---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MassSurfaceData.MassLevelDataId
source: html/c5c4242f-c490-ad24-dfdc-cdad552f728a.htm
---
# Autodesk.Revit.DB.Analysis.MassSurfaceData.MassLevelDataId Property

The MassLevelData used when the surface is horizontal, planar, and at the same height as a MassLevelData
 related to the same mass as the referenced face.

## Syntax (C#)
```csharp
public ElementId MassLevelDataId { get; }
```